#pragma once // Директива препроцессора для обеспечения однократного включения заголовочного файла

/// <summary>
/// Функция проверки ввода целого значения
/// </summary>
/// <returns>Возвращает введённое значение</returns>
int getInt();

/// <summary>
/// Функция проверки ввода логического значения
/// </summary>
/// <returns>Возвращает введённое значение</returns>
bool getBool();

/// <summary>
/// Функция проверки ввода положительного целого значения
/// </summary>
/// <returns>Возвращает введённое значение</returns>
int getPositiveInt();